# Написать в отдельном модуле функцию count_day подсчета количества дней между двумя датами с
# использованием методов модуля datetime. Функция принимает два параметра в формате даты,
# например, count_day(12.01.2021, 15.02.2021) и выдает целое число.

from module.module import count_days

print(count_days("12.01.2021","15.02.2021"))